Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/edc/PIC32CM5164LE00048.PIC
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="COMPCTRL3" edc:nzwidth="0x20" edc:access="--nn-nnn--nnn-nnnnnn-nnn-n-nnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x373BF75E" edc:_addr="0x4000341C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="SINGLE" edc:nzwidth="0x1" edc:desc="Single-Shot Mode"/>
            <edc:SFRFieldDef edc:cname="INTSEL" edc:nzwidth="0x2" edc:desc="Interrupt Selection">
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="Interrupt on comparator output toggle" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Interrupt on comparator output rising" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Interrupt on comparator output falling" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EOC" edc:desc="Interrupt on end of comparison (single-shot mode only)" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x3" edc:desc="Negative Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="I/O pin 0 for COMPCTRL0/1" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="I/O pin 0 for COMPCTRL2/3" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="I/O pin 1 for COMPCTRL0/1" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="I/O pin 1 for COMPCTRL2/3" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="I/O pin 2 for COMPCTRL0/1" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="I/O pin 2 for COMPCTRL2/3" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="I/O pin 3 for COMPCTRL0/1" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="I/O pin 3 for COMPCTRL2/3" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="AVSS" edc:desc="Ground" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="VSCALE" edc:desc="AVDD Scaler" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="BANDGAP" edc:desc="Internal Bandgap Voltage" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC Voltage Output 0 for COMPCTRL0/2" edc:when="(field &amp; 0x7) == 7"/>
              <edc:SFRFieldSemantic edc:cname="OPAMP2" edc:desc="OPAMP2 Output for COMPCTRL1/3" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x3" edc:desc="Positive Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="I/O pin 0 for COMPCTRL0/1" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="I/O pin 0 for COMPCTRL2/3" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="I/O pin 1 for COMPCTRL0/1" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="I/O pin 1 for COMPCTRL2/3" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="I/O pin 2 for COMPCTRL0/1" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="I/O pin 2 for COMPCTRL2/3" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="I/O pin 3 for COMPCTRL0/1" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="I/O pin 3 for COMPCTRL2/3" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="VSCALE" edc:desc="AVDD Scaler" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SWAP" edc:nzwidth="0x1" edc:desc="Swap Inputs and Invert"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Speed Selection">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low speed" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEDLOW" edc:desc="Medium low speed" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MEDHIGH" edc:desc="Medium high speed" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High speed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HYSTEN" edc:nzwidth="0x1" edc:desc="Hysteresis Enable"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:nzwidth="0x2" edc:desc="Hysteresis Level">
              <edc:SFRFieldSemantic edc:cname="HYST50" edc:desc="50mV" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HYST70" edc:desc="70mV" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="HYST90" edc:desc="90mV" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HYST110" edc:desc="110mV" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLEN" edc:nzwidth="0x3" edc:desc="Filter Length">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No filtering" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAJ3" edc:desc="3-bit majority function (2 of 3)" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MAJ5" edc:desc="5-bit majority function (3 of 5)" edc:when="(field &amp; 0x7) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUT" edc:nzwidth="0x2" edc:desc="Output">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The output of COMPn is not routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="The asynchronous output of COMPn is routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="-------------------------rrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F" edc:_addr="0x40003420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="WINCTRL" edc:nzwidth="0x1" edc:desc="WINCTRL Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="COMPCTRL0" edc:nzwidth="0x1" edc:desc="COMPCTRL 0 Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="COMPCTRL1" edc:nzwidth="0x1" edc:desc="COMPCTRL 1 Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="COMPCTRL2" edc:nzwidth="0x1" edc:desc="COMPCTRL 2 Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="COMPCTRL3" edc:nzwidth="0x1" edc:desc="COMPCTRL 3 Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="APBB" edc:beginaddr="0x41000000" edc:endaddr="0x4100A02C" edc:rw="rw">
      <edc:AdjustPoint edc:offset="0x2000" edc:_addr="0x41000000"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CTRL" edc:nzwidth="0x8" edc:access="----ww-w" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD" edc:_addr="0x41002000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC" edc:nzwidth="0x1" edc:desc="32-bit Cyclic Redundancy Code"/>
            <edc:SFRFieldDef edc:cname="MBIST" edc:nzwidth="0x1" edc:desc="Memory built-in self-test"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="STATUSA" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x41002001">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Done"/>
            <edc:SFRFieldDef edc:cname="CRSTEXT" edc:nzwidth="0x1" edc:desc="CPU Reset Phase Extension"/>
            <edc:SFRFieldDef edc:cname="BERR" edc:nzwidth="0x1" edc:desc="Bus Error"/>
            <edc:SFRFieldDef edc:cname="FAIL" edc:nzwidth="0x1" edc:desc="Failure"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Protection Error"/>
            <edc:SFRFieldDef edc:cname="BREXT" edc:nzwidth="0x1" edc:desc="BootRom Phase Extension"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="STATUSB" edc:nzwidth="0x8" edc:access="rrrrrrrr" edc:_addr="0x41002002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DAL" edc:nzwidth="0x2" edc:desc="Debugger Access Level">
              <edc:SFRFieldSemantic edc:cname="SECURED" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FULL_DEBUG" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DBGPRES" edc:nzwidth="0x1" edc:desc="Debugger Present"/>
            <edc:SFRFieldDef edc:cname="HPE" edc:nzwidth="0x1" edc:desc="Hot-Plugging Enable"/>
            <edc:SFRFieldDef edc:cname="DCCD0" edc:nzwidth="0x1" edc:desc="Debug Communication Channel 0 Dirty"/>
            <edc:SFRFieldDef edc:cname="DCCD1" edc:nzwidth="0x1" edc:desc="Debug Communication Channel 1 Dirty"/>
            <edc:SFRFieldDef edc:cname="BCCD0" edc:nzwidth="0x1" edc:desc="Boot ROM Communication Channel 0 Dirty"/>
            <edc:SFRFieldDef edc:cname="BCCD1" edc:nzwidth="0x1" edc:desc="Boot ROM Communication Channel 1 Dirty"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x41002003"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="AMOD" edc:nzwidth="0x2" edc:desc="Access Mode"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1E" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
