Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/edc/PIC32CM5164LE00048.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x41004028"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="SECCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnn-------------nnn-----n-n" edc:por="00000000000000000000000000110000" edc:mclr="00000000000000000000000000110000" edc:impl="0xFF000705" edc:_addr="0x41004034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="TAMPEEN" edc:nzwidth="0x1" edc:desc="Tamper Erase Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SILACC" edc:nzwidth="0x1" edc:desc="Silent Access"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TEROW" edc:nzwidth="0x3" edc:desc="Tamper Rease Row"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Write Key">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Write Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="SCFGB" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000011" edc:mclr="00000000000000000000000000000011" edc:impl="0x3" edc:_addr="0x41004038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="BCREN" edc:nzwidth="0x1" edc:desc="Boot Configuration Row Read Enable"/>
            <edc:SFRFieldDef edc:cname="BCWEN" edc:nzwidth="0x1" edc:desc="Boot Configuration Row Write Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="SCFGAD" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000001" edc:mclr="00000000000000000000000000000001" edc:impl="0x1" edc:_addr="0x4100403C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="URWEN" edc:nzwidth="0x1" edc:desc="User Row Write Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8C" edc:_addr="0x41004040"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="MEMTYPE" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x410040CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SMEMP" edc:nzwidth="0x1" edc:desc="System Memory Present"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID4" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x410040D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPCC" edc:nzwidth="0x4" edc:desc="JEP-106 Continuation Code"/>
            <edc:SFRFieldDef edc:cname="FKBC" edc:nzwidth="0x4" edc:desc="4KB count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410040D4"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410040D8"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410040DC"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000011010000" edc:mclr="00000000000000000000000011010000" edc:impl="0xFF" edc:_addr="0x410040E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBL" edc:nzwidth="0x8" edc:desc="Part Number Low"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000011111100" edc:mclr="00000000000000000000000011111100" edc:impl="0xFF" edc:_addr="0x410040E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBH" edc:nzwidth="0x4" edc:desc="Part Number High"/>
            <edc:SFRFieldDef edc:cname="JEPIDCL" edc:nzwidth="0x4" edc:desc="Low part of the JEP-106 Identity Code"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000001001" edc:mclr="00000000000000000000000000001001" edc:impl="0xFF" edc:_addr="0x410040E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPIDCH" edc:nzwidth="0x3" edc:desc="JEP-106 Identity Code High"/>
            <edc:SFRFieldDef edc:cname="JEPU" edc:nzwidth="0x1" edc:desc="JEP-106 Identity Code is used"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
