Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/edc/PIC32CM5164LE00048.PIC
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0xE0001004"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PCSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000101C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="EIASAMPLE" edc:nzwidth="0x20" edc:desc="Executed instruction address sample"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMPARATOR0DWT_COMP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="Cycle/PC/data value or data address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0001024"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMPARATOR0DWT_FUNCTION" edc:nzwidth="0x20" edc:access="nnnnn--n------------nn----nnnnnn" edc:impl="0xF9000C3F" edc:_addr="0xE0001028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MATCH" edc:nzwidth="0x4" edc:desc="Match type"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action on match"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2" edc:desc="Data value size"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1" edc:desc="Comparator matched"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x5" edc:desc="Identify capability"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000102C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMPARATOR1DWT_COMP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="Cycle/PC/data value or data address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0001034"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMPARATOR1DWT_FUNCTION" edc:nzwidth="0x20" edc:access="nnnnn--n------------nn----nnnnnn" edc:impl="0xF9000C3F" edc:_addr="0xE0001038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MATCH" edc:nzwidth="0x4" edc:desc="Match type"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action on match"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2" edc:desc="Data value size"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1" edc:desc="Comparator matched"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x5" edc:desc="Identify capability"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF74" edc:_addr="0xE000103C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_LAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0001FB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x20" edc:desc="Lock access control">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_LSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0xE0001FB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="SLI" edc:nzwidth="0x1" edc:desc="Software Lock implemented"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:nzwidth="0x1" edc:desc="Software Lock status"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:nzwidth="0x1" edc:desc="Not thirty-two bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0001FB8"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_DEVARCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="01000111011100000001101000000010" edc:mclr="01000111011100000001101000000010" edc:_addr="0xE0001FBC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:nzwidth="0xC" edc:desc="Architecture Part"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:nzwidth="0x4" edc:desc="Architecture Version"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:nzwidth="0x1" edc:desc="DEVARCH Present"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:nzwidth="0xB" edc:desc="Architect"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0xE0001FC0"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_DEVTYPE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0xE0001FCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:nzwidth="0x4" edc:desc="Major type"/>
            <edc:SFRFieldDef edc:cname="SUB" edc:nzwidth="0x4" edc:desc="Sub-type"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR4" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0001FD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="DES_2" edc:nzwidth="0x4" edc:desc="JEP106 continuation code"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x4" edc:desc="4KB count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0001FD4"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0001FD8"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0001FDC"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0001FE0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PART_0" edc:nzwidth="0x8" edc:desc="Part number bits[7:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
