Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/edc/PIC32CM5164LE00048.PIC
      <edc:SFRDef ltx:memberofperipheral="SERCOM4" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnn-n----nnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FE87FF" edc:addr="0x42001424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="GENCEN" edc:nzwidth="0x1" edc:desc="General Call Address Enable"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0xA" edc:desc="Address Value"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TENBITEN" edc:nzwidth="0x1" edc:desc="Ten Bit Addressing Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDRMASK" edc:nzwidth="0xA" edc:desc="Address Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM4" edc:cname="DATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x42001428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM4" edc:cname="FIFOSPACE" edc:nzwidth="0x10" edc:access="---rrrrr---rrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x1F1F" edc:addr="0x42001434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="TXSPACE" edc:nzwidth="0x5" edc:desc="Tx FIFO Empty Space"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RXSPACE" edc:nzwidth="0x5" edc:desc="Rx FIFO Filled Space"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM4" edc:cname="FIFOPTR" edc:nzwidth="0x10" edc:access="----nnnn----nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF0F" edc:addr="0x42001436">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="CPUWRPTR" edc:nzwidth="0x4" edc:desc="CPU FIFO Write Pointer"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CPURDPTR" edc:nzwidth="0x4" edc:desc="CPU FIFO Read Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="SERCOM4/SPIM">
      <edc:SFRDef ltx:memberofperipheral="SERCOM4" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="-nnnnnnn--nn--nn-------nn--nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F33019F" edc:addr="0x42001400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x3" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI in master operation" edc:when="(field &amp; 0x7) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:SFRFieldDef edc:cname="IBON" edc:nzwidth="0x1" edc:desc="Immediate Buffer Overflow Notification">
              <edc:SFRFieldSemantic edc:cname="0x0" edc:desc="STATUS.BUFOVF is set when it occurs in the data stream" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="0x1" edc:desc="STATUS.BUFOVF is set immediately upon buffer overflow" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DOPO" edc:nzwidth="0x2" edc:desc="Data Out Pinout">
              <edc:SFRFieldSemantic edc:cname="PAD0" edc:desc="DO on PAD[0], SCK on PAD[1] and SS on PAD[2]" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PAD3" edc:desc="DO on PAD[3], SCK on PAD[1] and SS on PAD[2]" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIPO" edc:nzwidth="0x2" edc:desc="Data In Pinout">
              <edc:SFRFieldSemantic edc:cname="PAD0" edc:desc="SERCOM PAD[0] is used as data input" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PAD1" edc:desc="SERCOM PAD[1] is used as data input" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PAD2" edc:desc="SERCOM PAD[2] is used as data input" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PAD3" edc:desc="SERCOM PAD[3] is used as data input" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FORM" edc:nzwidth="0x4" edc:desc="Frame Format">
              <edc:SFRFieldSemantic edc:cname="SPI_FRAME" edc:desc="SPI Frame" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SPI_FRAME_WITH_ADDR" edc:desc="SPI Frame with Addr" edc:when="(field &amp; 0xF) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:nzwidth="0x1" edc:desc="Clock Phase">
              <edc:SFRFieldSemantic edc:cname="LEADING_EDGE" edc:desc="The data is sampled on a leading SCK edge and changed on a trailing SCK edge" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRAILING_EDGE" edc:desc="The data is sampled on a trailing SCK edge and changed on a leading SCK edge" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW" edc:desc="SCK is low when idle" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH" edc:desc="SCK is high when idle" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DORD" edc:nzwidth="0x1" edc:desc="Data Order">
              <edc:SFRFieldSemantic edc:cname="MSB" edc:desc="MSB is transmitted first" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LSB" edc:desc="LSB is transmitted first" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
